{
    "text": "ГОСТ 19-404-79 Пояснительная записка",
    "description": "",
    "snippet": "документ(ГОСТ-19-106-78)\n\n--\n\nтитульный-лист()\nлу - ru.milofon.00001-01 81 01-ЛУ\nполе-3-п - Программный модуль milofon-prelum\nполе-3-д - Пояснительная записка\nполе-4 - ru.milofon.00001-01 81 01\n--\n\nаннотация()\n\nНастоящий документ содержит ...\n\nпримечания()\n) В документе приводят схему алгоритма, общее описание алгоритма и (или) функционирования программы, а также обоснование принятых технических и технико-экономических решений.\n\n) В зависимости от особенностей документа отдельные разделы (подразделы) допускается объединять, а также вводить новые разделы (подразделы).\n\n) В приложение к документу могут быть включены таблицы, обоснования, методики, расчеты и другие документы, использованные при разработке.\n--\n\nсодержание()\n\n+ Введение\n\nпримечание() В разделе \"Введение\" указывают наименование программы и (или) условное обозначение темы разработки, а также документы, на основании которых ведется разработка, с указанием организации и даты утверждения.\n\n+ Назначение и область применения\n\nпримечание() В разделе \"Назначение и область применения\" указывают назначение программы, краткую характеристику области применения программы.\n\n+ Технические характеристики\n\n++ Постановка задачи на разработку программы\n\n++ Описание алгоритма и функционирования программы\n\n++ Описание и обоснование выбора метода организации входных и выходных данных\n\n++ Описание и обоснование выбора состава технических и программных средств\n\n+ Ожидаемые технико-экономические показатели\n\nпримечание() В разделе \"Ожидаемые технико-экономические показатели\" указывают технико-экономические показатели, обосновывающие преимущество выбранного варианта технического решения, а также, при необходимости, ожидаемые оперативные показатели.\n\n+ Источники, использованные при разработке\n\nпримечание() В разделе \"Источники, использованные при разработке\" указывают перечень научно-технических публикаций, нормативно-технических документов и других научно-технических материалов, на которые есть ссылки в основном тексте.\n\n\nперечень-терминов()\n\n--\n\nперечень-сокращений()\n\n--\n\nперечень-рисунков()\n\nперечень-таблиц()\n\nпредметный-указатель()\n\n--\n\nперечень-ссылочных-документов()\n\nперечень-символов()\n\n--\n\nлист-регистрации-изменений()"
}
