{
    "text": "ГОСТ 19.504-79 Руководство программиста",
    "description": "",
    "snippet": "документ(ГОСТ-19-106-78)\n\n--\n\nтитульный-лист()\nлу - ru.milofon.00001-01 33 01-ЛУ\nполе-3-п - Программный модуль milofon-prelum\nполе-3-д - Руководство программиста\nполе-4 - ru.milofon.00001-01 33 01\n--\n\nаннотация()\n\nНастоящий документ содержит ...\n\nпримечания()\n) В документе приводят сведения для эксплуатации программы.\n\n) В зависимости от особенностей документа допускается объединять отдельные разделы или вводить новые.\n\n) В приложении к руководству программиста могут быть приведены дополнительные материалы (примеры, иллюстрации, таблицы, графики и т. п.).\n--\n\nсодержание()\n\n+ Назначение и условия применения программы\n\nпримечание() В разделе \"Назначение и условия применения программы\" должны быть указаны назначение и функции, выполняемые программой, условия, необходимые для выполнения программы (объем оперативной памяти, требования к составу и параметрам периферийных устройств, требования к программному обеспечению и т. п.).\n\n+ Характеристики программы\n\nпримечание() В разделе \"Характеристики программы\" должно быть приведено описание основных характеристик и особенностей программы (временные характеристики, режим работы, средства контроля правильности выполнения и самовосстанавливаемости программы и т. п.).\n\n+ Обращение к программе\n\nпримечание() В разделе \"Обращение к программе\" должно быть приведено описание процедур вызова программы (способы передачи управления и параметров данных и др.).\n\n+ Входные и выходные данные\n\nпримечание() В разделе \"Входные и выходные данные\" должно быть приведено описание организации используемой входной и выходной информации и, при необходимости, ее кодирования.\n\n+ Сообщения\n\nпримечание() В разделе \"Сообщения\" должны быть указаны тексты сообщений, выдаваемых программисту или оператору в ходе выполнения программы, описание их содержания и действия, которые необходимо предпринять по этим сообщениям.\n\nперечень-терминов()\n\n--\n\nперечень-сокращений()\n\n--\n\nперечень-рисунков()\n\nперечень-таблиц()\n\nпредметный-указатель()\n\n--\n\nперечень-ссылочных-документов()\n\nперечень-символов()\n\n--\n\nлист-регистрации-изменений()"
}
