{
    "text": "ГОСТ 19.201-78 Техническое задание",
    "description": "",
    "snippet": "документ(ГОСТ-19-106-78)\n\n--\n\nтитульный-лист()\nлу - ru.milofon.00001-01 00 01-ЛУ\nполе-3-п - Программный модуль milofon-prelum\nполе-3-д - Техническое задание\nполе-4 - ru.milofon.00001-01 00 01\n--\n\nаннотация()\n\nНастоящий документ содержит ...\n\nпримечания()\n) В документе приводят назначение и область применения программы, технические, технико-экономические и специальные требования, предъявляемые к программе, необходимые стадии и сроки разработки, виды испытаний.\n\n) Для внесения изменений или дополнений в техническое задание на последующих стадиях разработки программы или программного изделия выпускают дополнение к нему. Согласование и утверждение дополнения к техническому заданию проводят в том же порядке, который установлен для технического задания.\n\n) В зависимости от особенностей программы или программного изделия допускается уточнять содержание разделов, вводить новые разделы или объединять отдельные из них.\n\n) В приложениях к техническому заданию, при необходимости, приводят: перечень научно-исследовательских и других работ, обосновывающих разработку; схемы алгоритмов, таблицы, описания, обоснования, расчеты и другие документы, которые могут быть использованы при разработке; другие источники разработки.\n--\n\nсодержание()\n\n+ Введение\n\nпримечание() В разделе «Введение» указывают наименование, краткую характеристику области применения программы или программного изделия и объекта, в котором используют программу или программное изделие.\n\n+ Основания для разработки\n\nпримечание() В разделе «Основания для разработки» должны быть указаны: документ (документы), на основании которых ведется разработка; организация, утвердившая этот документ, и дата его утверждения; наименование и (или) условное обозначение темы разработки.\n\n+ Назначение разработки\n\nпримечание() В разделе «Назначение разработки» должно быть указано функциональное и эксплуатационное назначение программы или программного изделия.\n\n+ Требования к программе или программному изделию\n\n++ Требования к функциональным характеристикам\n\nпримечание() В подразделе «Требования к функциональным характеристикам» должны быть указаны требования к составу выполняемых функций, организации входных и выходных данных, временным характеристикам и т.п.\n\n++ Требования к надежности\n\nпримечание() В подразделе «Требования к надежности» должны быть указаны требования к обеспечению надежного функционирования (обеспечения устойчивого функционирования, контроль входной и выходной информации, время восстановления после отказа и т.п.).\n\n++ Условия эксплуатации\n\nпримечание() В подразделе «Условия эксплуатации» должны быть указаны условия эксплуатации (температура окружающего воздуха, относительная влажность и т.п. для выбранных типов носителей данных), при которых должны обеспечиваться заданные характеристики, а также вид обслуживания, необходимое количество и квалификация персонала.\n\n++ Требования к составу и параметрам технических средств\n\nпримечание() В подразделе «Требования к составу и параметрам технических средств» указывают необходимый состав технических средств с указанием их основных технических характеристик.\n\n++ Требования к информационной и программной совместимости\n\nпримечание() В подразделе «Требования к информационной и программной совместимости» должны быть указаны требования к информационным структурам на входе и выходе и методам решения, исходным кодам, языкам программирования и программным средствам, используемым программой. При необходимости должна обеспечиваться защита информации и программ.\n\n++ Требования к маркировке и упаковке\n\nпримечание() В подразделе «Требования к маркировке и упаковке» в общем случае указывают требования к маркировке программного изделия, варианты и способы упаковки.\n\n++ Требования к транспортированию и хранению\n\nпримечание() В подразделе «Требования к транспортированию и хранению» должны быть указаны для программного изделия условия транспортирования, места хранения, условия хранения, условия складирования, сроки хранения в различных условиях.\n\n++ Специальные требования\n\n+ Требования к программной документации\n\nпримечание() В разделе «Требования к программной документации» должен быть указан предварительный состав программной документации и, при необходимости, специальные требования к ней.\n\n+ Технико-экономические показатели\n\nпримечание() В разделе «Технико-экономические показатели» должны быть указаны: ориентировочная экономическая эффективность, предполагаемая годовая потребность, экономические преимущества разработки по сравнению с лучшими отечественными и зарубежными образцами или аналогами.\n\n+ Стадии и этапы разработки\n\nпримечание() В разделе «Стадии и этапы разработки» устанавливают необходимые стадии разработки, этапы и содержание работ (перечень программных документов, которые должны быть разработаны, согласованы и утверждены), а также, как правило, сроки разработки и определяют исполнителей.\n\n\nперечень-терминов()\n\n--\n\nперечень-сокращений()\n\n--\n\nперечень-рисунков()\n\nперечень-таблиц()\n\nпредметный-указатель()\n\n--\n\nперечень-ссылочных-документов()\n\nперечень-символов()\n\n--\n"
}
