{
    "text": "ГОСТ 19.503-79 Руководство системного программиста",
    "description": "",
    "snippet": "документ(ГОСТ-19-106-78)\n\n--\n\nтитульный-лист()\nлу - ru.milofon.00001-01 32 01-ЛУ\nполе-3-п - Программный модуль milofon-prelum\nполе-3-д - Руководство системного программиста\nполе-4 - ru.milofon.00001-01 32 01\n--\n\nаннотация()\n\nНастоящий документ содержит ...\n\nпримечания()\n) В документе приводят сведения для проверки, обеспечения функционирования и настройки программы на условия конкретного применения.\n\n) В зависимости от особенностей документа допускается объединять отдельные разделы или вводить новые.\n\n) В обоснованных случаях допускается раздел «Дополнительные возможности» не приводить, а в наименованиях разделов опускать слово «программа» или заменять его на «наименование программы».\n\n) В приложении к руководству системного программиста могут быть приведены дополнительные материалы (примеры, иллюстрации, таблицы, графики и т. п.).\n--\n\nсодержание()\n\n+ Общие сведения о программе\n\nпримечание() В разделе «Общие сведения о программе» должны быть указаны назначение и функции программы и сведения о технических и программных средствах, обеспечивающих выполнение данной программы.\n\n+ Структура программы\n\nпримечание() В разделе «Структура программы» должны быть приведены сведения о структуре программы, ее составных частях, о связях между составными частями и о связях с другими программами.\n\n+ Настройка программы\n\nпримечание() В разделе «Настройка программы» должно быть приведено описание действий по настройке программы на условия конкретного применения (настройка на состав технических средств, выбор функций и др.).\n\n+ Проверка программы\n\nпримечание() В разделе «Проверка программы» должно быть приведено описание способов проверки, позволяющих дать общее заключение о работоспособности программы (контрольные примеры, методы прогона, результаты).\n\n+ Дополнительные возможности\n\nпримечание() В разделе «Дополнительные возможности» должно быть приведено описание дополнительных разделов функциональных возможностей программы и способов их выбора.\n\n+ Сообщения системному программисту\n\nпримечание() В разделе «Сообщения системному программисту» должны быть указаны тексты сообщений, выдаваемых в ходе выполнения настройки, проверки программы, а также в ходе выполнения программы, описание их содержания и действий, которые необходимо предпринять по этим сообщениям.\n\nперечень-терминов()\n\n--\n\nперечень-сокращений()\n\n--\n\nперечень-рисунков()\n\nперечень-таблиц()\n\nпредметный-указатель()\n\n--\n\nперечень-ссылочных-документов()\n\nперечень-символов()\n\n--\n\nлист-регистрации-изменений()"
}
