{
    "text": "ГОСТ 19.506-79 Описание языка",
    "description": "",
    "snippet": "документ(ГОСТ-19-106-78)\n\n--\n\nтитульный-лист()\nлу - ru.milofon.00001-01 35 01-ЛУ\nполе-3-п - Программный модуль milofon-prelum\nполе-3-д - Описание языка\nполе-4 - ru.milofon.00001-01 35 01\n--\n\nаннотация()\n\nНастоящий документ содержит ...\n\nпримечания()\n) В документе приводят описание синтаксиса и семантики языка (программирования, управления заданиями, организации вычислительного процесса и т. п.).\n\n) В зависимости от особенностей языка допускается объединять отдельные разделы или вводить новые.\n\n) При необходимости содержание разделов должно быть пояснено примерами.\n\n) В приложения к описанию языка могут быть включены дополнительные материалы (формализованные описания языковых средств, иллюстрации, таблицы, графики, формы бланков и т. п.).\n--\n\nсодержание()\n\n+ Общие сведения\n\nпримечание() В разделе \"Общие сведения\" должны быть указаны назначение и описание общих характеристик языка, его возможностей, основных областей применения и другие сведения.\n\n+ Элементы языка\n\nпримечание() В разделе \"Элементы языка\" должно быть указано описание синтаксиса и семантики базовых и составных элементов языка.\n\n+ Способы структурирования программы\n\nпримечание() В разделе \"Способы структурирования программы\" должны быть указаны способы вызова процедур передачи управления и другие элементы структурирования программы.\n\n+ Средства обмена данными\n\nпримечание() В разделе \"Средства обмена данными\" должно быть приведено описание языковых средств обмена данными (например, средства ввода-вывода, внутреннего обмена данными и т. п.).\n\n+ Встроенные элементы\n\nпримечание() В разделе \"Встроенные элементы\" должны быть приведены описание встроенных в язык элементов (например, функции, классы и т. п.) и правила их использования.\n\n+ Средства отладки программы\n\nпримечание() В разделе \"Средства отладки программы\" должны быть: приведено описание имеющихся в языке средств отладки программ, семантики этих средств, даны рекомендации по их применению.\n\nперечень-терминов()\n\n--\n\nперечень-сокращений()\n\n--\n\nперечень-рисунков()\n\nперечень-таблиц()\n\nпредметный-указатель()\n\n--\n\nперечень-ссылочных-документов()\n\nперечень-символов()\n\n--\n\nлист-регистрации-изменений()"
}
