{
  "text": "ГОСТ 7.32-2001 Отчет о научно-исследовательской работе",
  "code": "ГОСТ-7-32-2001",
  "description": "",
  "snippet": "документ(ГОСТ-7-32-2001)\n\n--\n\nтитульный-лист()\nвышестоящая - Министерство общего и профессионального образования Российской Федерации\nорганизация - Уфимский государственный авиационный технический университет\nсокращенное - УГАТУ\nудк - 378.14\nокп - окп\nгосрегистрация - 01970006723\nинв-номер - 1\nвид-документа - ОТЧЕТ О НАУЧНО-ИССЛЕДОВАТЕЛЬСКОЙ РАБОТЕ\nутв-должность - Проректор университета по научной работе\nутв-фио - Н.С. Жернаков\nнаименование - Социально-экономические проблемы подготовки военных специалистов в гражданских вузах России\nтема - ФЕМИНИЗАЦИЯ АРМИИ КАК СОЦИАЛЬНЫЙ ПРОЦЕСС\nвид - промежуточный\nшифр - RU-MILOFON-НИР-0001\nруководитель - Зам. проректора по научной работе\nруководитель-фио - Р.А. Бадамшин\nруководитель-темы - Руководитель темы\nруководитель-темы-фио - Г.А. Кабакович\nгород - Москва\nгод - 2016\n--\n\nпримечания()\n) Отчет о НИР - научно-технический документ, который содержит систематизированные данные о научно-исследовательской работе, описывает состояние научно-технической проблемы, процесс и/или результаты научного исследования.\n\n) По результатам выполнения НИР составляется заключительный отчет о работе в целом. Кроме того, по отдельным этапам НИР могут быть составлены промежуточные отчеты, что отражается в Техническом задании на НИР и в календарном плане выполнения НИР.\n--\n\nреферат()\n\n--\n\nпримечания()\n) Общие требования к реферату на отчет о НИР - по ГОСТ 7.9.\n\n) Реферат должен содержать:\n- сведения об объеме отчета, количестве иллюстраций, таблиц, приложений, количестве частей отчета, количестве использованных источников;\n- перечень ключевых слов;\n- текст реферата.\n\n) Перечень ключевых слов должен включать от 5 до 15 слов или словосочетаний из текста отчета, которые в наибольшей мере характеризуют его содержание и обеспечивают возможность информационного поиска. Ключевые слова приводятся в именительном падеже и печатаются прописными буквами в строку через запятые.\n\n) Текст реферата должен отражать:\n- объект исследования или разработки;\n- цель работы;\n- метод или методологию проведения работы;\n- результаты работы и их новизну;\n- основные конструктивные, технологические и технико-эксплуатационные характеристики;\n- степень внедрения;\n- рекомендации по внедрению или итоги внедрения результатов НИР;\n- область применения;\n- экономическую эффективность или значимость работы;\n- прогнозные предположения о развитии объекта исследования.\nЕсли отчет не содержит сведений по какой-либо из перечисленных структурных частей реферата, то в тексте реферата она опускается, при этом последовательность изложения сохраняется.\n--\n\nсодержание()\n\nопределения()\n\n--\n\nобозначения-и-сокращения()\n\n--\n\nвведение()\n\nпримечания()\n) Введение должно содержать оценку современного состояния решаемой научно-технической проблемы, основание и исходные данные для разработки темы, обоснование необходимости проведения НИР, сведения о планируемом научно-техническом уровне разработки, о патентных исследованиях и выводы из них, сведения о метрологическом обеспечении НИР. Во введении должны быть показаны актуальность и новизна темы, связь данной работы с другими научно-исследовательскими работами.\n\n) Во введении промежуточного отчета по этапу НИР должны быть приведены цели и задачи этапа исследований, их место в выполнении НИР в целом.\n--\n\n+ Раздел 1\n\nпримечания()\n) В основной части отчета приводят данные, отражающие сущность, методику и основные результаты выполненной НИР.\n\n) Основная часть должна содержать:\nа) выбор направления исследований, включающий обоснование направления исследования, методы решения задач и их сравнительную оценку, описание выбранной общей методики проведения НИР;\nб) процесс теоретических и (или) экспериментальных исследований, включая определение характера и содержания теоретических исследований, методы исследований, методы расчета, обоснование необходимости проведения экспериментальных работ, принципы действия разработанных объектов, их характеристики;\nв) обобщение и оценку результатов исследований, включающих оценку полноты решения поставленной задачи и предложения по дальнейшим направлениям работ, оценку достоверности полученных результатов и технико-экономической эффективности их внедрения и их сравнение с аналогичными результатами отечественных и зарубежных работ, обоснование необходимости проведения дополнительных исследований, отрицательные результаты, приводящие к необходимости прекращения дальнейших исследований.\n\n) Представление в отчете данных о свойствах веществ и материалов проводятся по ГОСТ 7.54, единицы физических величин - по ГОСТ 8.417.\n--\n\n++ Подраздел 1.1\n\n= Пункт 1.1.1\n\nзаключение()\n\nпримечания()\n) Заключение должно содержать:\n- краткие выводы по результатам НИР или отдельных ее этапов;\n- оценку полноты решений поставленных задач;\n- разработку рекомендаций и исходных данных по конкретному использованию результатов НИР;\n- результаты оценки технико-экономической эффективности внедрения;\n- результаты оценки научно-технического уровня выполненной НИР в сравнении с лучшими достижениями в данной области.\n--\n\n\nсписок-использованных-источников()\n\n\nприложение(прил-пример) Приложение пример\n\nпримечания()\n) В приложения рекомендуется включать материалы, связанные с выполненной НИР, которые по каким-либо причинам не могут быть включены в основную часть. В приложения могут быть включены:\n- промежуточные математические доказательства, формулы и расчеты;\n- таблицы вспомогательных цифровых данных;\n- протоколы испытаний;\n- описание аппаратуры и приборов, применяемых при проведении экспериментов, измерений и испытаний;\n- заключение метрологической экспертизы;\n- инструкции, методики, разработанные в процессе выполнения НИР;\n- иллюстрации вспомогательного характера;\n- копии технического задания на НИР, программы работ, договора или другого исходного документа для выполнения НИР;\n- протокол рассмотрения выполненной НИР на научно-техническом совете;\n- акты внедрения результатов НИР и др.\n\n) В приложения к отчету о НИР, предшествующему постановке продукции на производство, должен быть включен проект технического задания на разработку (модернизацию) продукции или документ (заявка, протокол, контакт и др.), содержащий обоснованные технико-экономические требования к продукции.\n\n) В приложения к отчету о НИР, в составе которой предусмотрено проведение патентных исследований, должен быть включен отчет о патентных исследованиях, оформленный по ГОСТ Р 15.011, библиографический список публикаций и патентных документов, полученных в результате выполнения НИР, - по ГОСТ 7.1.\n--"
}
