{
    "text": "ГОСТ 19.402-78 Описание программы",
    "description": "",
    "snippet": "документ(ГОСТ-19-106-78)\n\n--\n\nтитульный-лист()\nлу - ru.milofon.00001-01 13 01-ЛУ\nполе-3-п - Программный модуль milofon-prelum\nполе-3-д - Описание программы\nполе-4 - ru.milofon.00001-01 13 01\n--\n\nаннотация()\n\nНастоящий документ содержит ...\n\nпримечания()\n) В документе приводят сведения о логической структуре и функционировании программы.\n\n) В зависимости от особенностей программы допускается вводить дополнительные разделы или объединять отдельные разделы.\n\n) Допускается содержание разделов иллюстрировать пояснительными примерами, таблицами, схемами, графиками.\n\n) В приложение к описанию программы допускается включать различные материалы, которые нецелесообразно включать в разделы описания.\n--\n\nсодержание()\n\n+ Общие сведения\n\nпримечание() В разделе \"Общие сведения\" должны быть указаны: обозначение и наименование программы; программное обеспечение, необходимое для функционирования программы; языки программирования, на которых написана программа.\n\n+ Функциональное назначение\n\nпримечание() В разделе \"Функциональное назначение\" должны быть указаны классы решаемых задач и (или) назначение программы и сведения о функциональных ограничениях на применение.\n\n+ Описание логической структуры\n\nпримечание() В разделе \"Описание логической структуры\" должны быть указаны: алгоритм программы; используемые методы; структура программы с описанием функций составных частей и связи между ними; связи программы с другими программами. Описание логической структуры программы выполняют с учетом текста программы на исходном языке.\n\n+ Используемые технические средства\n\nпримечание() В разделе \"Используемые технические средства\" должны быть указаны типы электронных вычислительных машин и устройств, которые используются при работе программы.\n\n+ Вызов и загрузка\n\nпримечание() В разделе \"Вызов и загрузка\" должны быть указаны: способ вызова программы с соответствующего носителя данных; входные точки в программу. Допускается указывать адреса загрузки, сведения об использовании оперативной памяти, объем программы.\n\n+ Входные данные\n\nпримечание() В разделе \"Входные данные\" должны быть указаны: характер, организация и предварительная подготовка входных данных; формат, описание и способ кодирования входных данных.\n\n+ Выходные данные\n\nпримечание() В разделе \"Выходные данные\" должны быть указаны: характер и организация выходных данных; формат, описание и способ кодирования выходных данных.\n\n\nперечень-терминов()\n\n--\n\nперечень-сокращений()\n\n--\n\nперечень-рисунков()\n\nперечень-таблиц()\n\nпредметный-указатель()\n\n--\n\nперечень-ссылочных-документов()\n\nперечень-символов()\n\n--\n\nлист-регистрации-изменений()"
}
