{
    "text": "ГОСТ 19.301-79 Программа и методика испытаний",
    "description": "",
    "snippet": "документ(ГОСТ-19-106-78)\n\n--\n\nтитульный-лист()\nлу - ru.milofon.00001-01 51 01-ЛУ\nполе-3-п - Программный модуль milofon-prelum\nполе-3-д - Программа и методика испытаний\nполе-4 - ru.milofon.00001-01 51 01\n--\n\nаннотация()\n\nНастоящий документ содержит ...\n\nпримечания()\n) В документе приводят требования, подлежащие проверке при испытании программы, а также порядок и методы их контроля.\n\n) В зависимости от особенностей документа допускается вводить дополнительные разделы.\n\n) В приложение к документу могут быть включены тестовые примеры, контрольные распечатки тестовых примеров, таблицы, графики и т. п.\n--\n\nсодержание()\n\n+ Объект испытаний\n\nпримечание() В разделе \"Объект испытаний\" указывают наименование, область применения и обозначение испытуемой программы.\n\n+ Цель испытаний\n\nпримечание() В разделе \"Цель испытаний\" должна быть указана цель проведения испытаний.\n\n+ Требования к программе\n\nпримечание() В разделе \"Требования к программе\" должны быть указаны требования, подлежащие проверке во время испытаний и заданные в техническом задании на программу.\n\n+ Требования к программной документации\n\nпримечание() В разделе \"Требования к программной документации\" должны быть указаны состав программной документации, предъявляемой на испытания, а также специальные требования, если они заданы в техническом задании на программу.\n\n+ Средства и порядок испытаний\n\nпримечание() В разделе \"Средства и порядок испытаний\" должны быть указаны технические и программные средства, используемые во время испытаний, а также порядок проведения испытаний.\n\n+ Методы испытаний\n\nпримечание() В разделе \"Методы испытаний\" должны быть приведены описания используемых методов испытаний. Методы испытаний рекомендуется по отдельным показателям располагать в последовательности, в которой эти показатели расположены в разделах \"Требования к программе\" и \"Требования к программной документации\". В методах испытаний должны быть приведены описания проверок с указанием результатов проведения испытаний (перечней тестовых примеров, контрольных распечаток тестовых примеров и т. п.).\n\nперечень-терминов()\n\n--\n\nперечень-сокращений()\n\n--\n\nперечень-рисунков()\n\nперечень-таблиц()\n\nпредметный-указатель()\n\n--\n\nперечень-ссылочных-документов()\n\nперечень-символов()\n\n--\n\nлист-регистрации-изменений()"
}
